app/controllers/students_controller.rb

  def show
    @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (daenerys) LIMIT ?  [["LIMIT", 1]]